#include <iostream>
#include <map>

int main() {
    std::map<int, std::string> menu;

    menu[1] = "П'ятеро росіян зіли свого сусіда із сусідньоі квартири. 4 з них стверджували що він іх дістав, і тількі останній зізнався що було смачно";
    menu[2] = "Програміст помирає у 45 років і потрапляє до раю. Він запитує Бога, чому ж він помер так рано. \n Бог: — Сину мій, якщо враховувати, скільки відпрацьованих годин ти вказував у своїх звітах, ти прожив 82 роки.";
    menu[3] = "Антон Савицький";

    std::cout << "Працює інформаційна система факультету прикладної математики:\n";
    std::cout << "1. Новини дня\n";
    std::cout << "2. Анекдот тижня\n";
    std::cout << "3. Автора !!!\n";
    std::cout << "Введіть відповідний номер і натисніть ENTER. ";

    int choice;
    std::cin >> choice;

    if (menu.find(choice) != menu.end()) {
        std::cout << menu[choice] << std::endl;
    } else {
        std::cout << "Невірний вибір. Будь ласка, спробуйте ще раз." << std::endl;
    }

    return 0;
}
